       IDENTIFICATION DIVISION.
       PROGRAM-ID.    HELLO.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE  DIVISION.
           DISPLAY "Hello, world!"
           STOP RUN.
